Repository: pqhuy87it/Swift-Examples
Catalog: Design Patterns/MVVM/MVVM-iOS-Clean/MVVM-Clean/Localization/*.lproj/Localizable.strings
Languages: it

# login_title
source: Ready for login?
it: Pronto per la login?

# login_subtitle
source: Type "admin" as username and "pass123!" as password to login
it: Inserisci "admin" come username e "pass123!" come password per entrare

source: LOGIN
it: ENTRA

# login_error_message
source: Error on login
it: Sembra che tu abbia inserito username o password errate. Controlla e prova di nuovo!

# alert_error_title
source: Warning!
it: Attenzione!

# empty_credential
source: Please, fill the informations and try again!
it: Inserisci le credenziali e prova di nuovo

# wrong_password
source: Password, should be min 8 chars long
it: La password deve contenere almeno 8 caratteri

# welcome_message
source: COVID19 summary data
it: COVID19 dati di riepilogo

# last_summary_update
source: Last update %@
it: Ultimo aggiornamento %@

# generic_error_message
source: An error as accourred. Please, try again!
it: Si è verificato un errore per favore, riprova!

# generic_net_error_message
source: Here, you should get the server network error code %@.
it: Qui, dovresti recuperare l'errore di rete del server codice %@.

# generic_localized_net_error_message
source: This will be the localized message from the server.
it: Questo sarà il messaggio localizzato del server.

# nil_data
source: Data is nil
it: Data è nil

# nil_data_msg
source: No data found on server
it: Nessun dato ricevuto dal server

# new_confirmed_cases
source: Confirmed cases
it: Casi confermati

source: Total cases
it: Casi totali

# new_deaths_cases
source: Deaths cases
it: Casi di morte

# total_deaths
source: Total deaths cases
it: Morti totali

# new_recovered
source: Recovered cases
it: Nuovi ricoveri

# total_recovered
source: Total recovered cases
it: Ricoveri totali

# summary_mapper_error
source: SummaryModelMapper or HTTP response is nil and DTO could not be mapped.
it: SummaryModelMapper o la risposta HTTP è nil e il DTO non può essere mappato.

# countries_label
source: Countries
it: Paesi

# country_mapper_error
source: CountryModelMapper or http response is nil and DTO could not be mapped.
it: CountryModelMapper o la risposta HTTP è nil e il DTO non può essere mappato.

# new_cases_cell
source: New cases: %@
it: Nuovi casi: %@

# new_recovered_cell
source: New recovered cases: %@
it: Nuovi ricoveri: %@

# new_deaths_cell
source: New deaths cases: %@
it: Nuove morti: %@

# total_cases_cell
source: Total cases: %@
it: Casi totali: %@

# total_recovered_cell
source: Total recovered cases: %@
it: Ricoveri totali: %@

# total_deaths_cell
source: Total deaths cases: %@
it: Morti totali: %@

# no_local_user_found
source: No user data found in local storage
it: Non è stato trovato l'utente nei dati locali

# unable_logout
source: Unable to delete user data. Operation failed. Please, try again later.
it: Impossibile cancellare i dati utente. Operazione fallita. Per favore, prova più tardi.

source: New
it: Nuovi

source: Total
it: Totali

# no_content_found
source: No content found on server.
it: Nessun contenuto trovato.

# unauthorized_message
source: User not authorized
it: Utente non autorizzato

# badRequest_message
source: Bad request error!
it: Richiesta mal formattata.

# not_found_message
source: Resource not found
it: Risorsa non trovata

# forbidden_message
source: Forbidden access
it: Accesso non consentito

# user_not_found_message
source: User not found!
it: Utente non trovato.

# logout_error_message
source: Error on logout
it: Problemi in fase di logout

# no_connection_error_message
source: You seems to be offline
it: Sembra che tu sia offline!

# url_request_nil
source: Unable to create url request object
it: Impossibile creare l'oggetto URL Request

# no_local_data_found
source: No local summary data found
it: Non sono stati trovati dati locali di riassunto.

# json_decode_error
source: Error during json decoding
it: Errore durante il decode del JSON.
